# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 2 # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, CoordAttn, [128, 32]],
   [-1, 1, Conv, [256, 3, 2]],  # 4-P3/8
   [-1, 6, C3, [256]],          # 5
   [-1, 1, CoordAttn, [256, 32]],
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 9, C3, [512]],           # 8
   [-1, 1, CoordAttn, [512, 32]],
   [-1, 1, Conv, [1024, 3, 2]],  # 10-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, CoordAttn, [1024, 32]],
   [-1, 1, SPPF, [1024, 5]],  # 13
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat_BiFPN, [256, 256]],  #  16 cat backbone P4
   [-1, 3, C3, [512, False]],  # 17
   [-1, 1, CoordAttn, [512, 32]], # 18

   [-1, 1, Conv, [256, 1, 1]],  # 19
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat_BiFPN, [128, 128]],  # 21 cat backbone P3
   [-1, 3, C3, [256, False]],  # 22 (P3/8-small)
   [-1, 1, CoordAttn, [256, 32]], # 23

   [-1, 1, Conv, [512, 3, 2]],   # 24
   [[-1, 8, 17], 1, Concat_BiFPN, [256, 256]],  # 25 cat head P4
   [-1, 3, C3, [512, False]],  # 26 (P4/16-medium)
   [-1, 1, CoordAttn, [512, 32]], # 27

   [-1, 1, Conv, [512, 3, 2]],  # 28
   [[-1, 14], 1, Concat_BiFPN, [256, 256]],  # 29 cat head P5
   [-1, 3, C3, [1024, False]],  # 30 (P5/32-large)
   [-1, 1, CoordAttn, [1024, 32]], # 31

   [[22, 26, 30], 1, Decoupled_Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
