# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2 320x320
   [-1, 1, RepGhostBottleneck, [8, 16, 3, 1, 0, 0.58]],  # 1-P2/4

   [-1, 1, RepGhostBottleneck, [24, 24, 3, 2, 0, 0.58]], # 2 160x160
   [-1, 1, RepGhostBottleneck, [36, 24, 3, 1, 0, 0.58]],
   [-1, 1, RepGhostBottleneck, [36, 24, 3, 1, 0, 0.58]],

   [-1, 1, RepGhostBottleneck, [36, 40, 5, 2, 0.25, 0.58]], # 5 80x 80
   [-1, 1, RepGhostBottleneck, [60, 40, 5, 1, 0.25, 0.58]],
   [-1, 1, RepGhostBottleneck, [60, 40, 5, 1, 0.25, 0.58]],
   [-1, 1, RepGhostBottleneck, [60, 40, 5, 1, 0.25, 0.58]], # 8

   [-1, 1, RepGhostBottleneck, [128, 80, 3, 2, 0, 0.58]], # 9 40x40
   [-1, 1, RepGhostBottleneck, [100, 80, 3, 1, 0, 0.58]],
   [-1, 1, RepGhostBottleneck, [240, 112, 3, 1, 0.25, 0.58]],
   [-1, 1, RepGhostBottleneck, [336, 112, 3, 1, 0.25, 0.58]], # 12

   [-1, 1, RepGhostBottleneck, [336, 160, 5, 2, 0, 0.58]], # 13 20x20
   [-1, 1, RepGhostBottleneck, [480, 160, 5, 1, 0.25, 0.58]],
   [-1, 1, RepGhostBottleneck, [480, 160, 5, 1, 0, 0.58]],
   [-1, 1, RepGhostBottleneck, [480, 160, 5, 1, 0.25, 0.58]], # 16
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 12], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 20

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 24 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 21], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 27 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 17], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 30 (P5/32-large)

   [[24, 27, 30], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
