# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

#anchors: # extinguisher's anchors
#  - [11,33, 17,64, 37,46]  # P3/8
#  - [28,102, 63,86, 47,154]  # P4/16
#  - [107,124, 116,226, 264,404]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, GhostConvP, [128, 3, 2]],  # 1-P2/4
   [-1, 1, C3_Ghost_MLP, [128]],
   [-1, 1, GhostConvP, [256, 3, 2]],  # 3-P3/8
   [-1, 1, C3_Ghost_MLP, [256]],
   [-1, 1, GhostConvP, [512, 3, 2]],  # 5-P4/16
   [-1, 1, C3_Ghost_MLP, [512]],
   [-1, 1, GhostConvP, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, C3_Ghost_MLP, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, GhostConvP, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, C3_Ghost_MLP, [512, False]],  # 13

   [-1, 1, GhostConvP, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C3_Ghost_MLP, [256, False]],  # 17 (P3/8-small)

   [-1, 1, GhostConvP, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 1, C3_Ghost_MLP, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, GhostConvP, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 1, C3_Ghost_MLP, [1024, False]],  # 23 (P5/32-large)

   [17, 1, GhostConvP, [512, 1, 1]], # 24 8-reg
   [17, 1, GhostConvP, [512, 1, 1]], # 25 8-cls

   [20, 1, GhostConvP, [512, 1, 1]], # 26 16-reg
   [20, 1, GhostConvP, [256, 1, 1]], # 27 16-cls

   [23, 1, GhostConvP, [512, 1, 1]], # 28 32-reg
   [23, 1, GhostConvP, [512, 1, 1]], # 29 32-cls

   [2, 1, nn.AdaptiveAvgPool2d, [80]], # 30
   [2, 1, nn.AdaptiveAvgPool2d, [40]], # 31
   [2, 1, nn.AdaptiveAvgPool2d, [20]], # 32

   [8, 1, nn.Upsample, [None, 2, 'nearest']], # 33
   [8, 1, nn.Upsample, [None, 4, 'nearest']], # 34

   [[24, 30], 1, Concat, [1]], # 35
   [[25, 34], 1, Concat, [1]], # 36

   [[26, 31], 1, Concat, [1]], # 37
   [[27, 33], 1, Concat, [1]], # 38

   [[28, 32], 1, Concat, [1]], # 39
   [[29, 8], 1, Concat, [1]], # 40

   [35, 1, GhostConvP, [512, 1, 1]], # 41 8-reg
   [36, 1, GhostConvP, [512, 1, 1]], # 42 8-cls

   [37, 1, GhostConvP, [512, 1, 1]], # 43 16-reg
   [38, 1, GhostConvP, [512, 1, 1]], # 44 16-cls

   [39, 1, GhostConvP, [512, 1, 1]], # 45 32-reg
   [40, 1, GhostConvP, [512, 1, 1]], # 46 32-cls

   [[41, 42, 43, 44, 45, 46], 1, MixDecoupled_Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
