# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

#anchors: # extinguisher's anchors
#  - [11,33, 17,64, 37,46]  # P3/8
#  - [28,102, 63,86, 47,154]  # P4/16
#  - [107,124, 116,226, 264,404]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [17, 1, Conv, [256, 3, 1]], # 24 8-reg
   [17, 1, Conv, [256, 3, 1]], # 25 8-cls

   [20, 1, Conv, [256, 3, 1]], # 26 16-reg
   [20, 1, Conv, [256, 3, 1]], # 27 16-cls

   [23, 1, Conv, [256, 3, 1]], # 28 32-reg
   [23, 1, Conv, [256, 3, 1]], # 29 32-cls

   # 8倍下采样
   [26, 1, DeConv, [256, 2, 2, 0]], # 30 8-reg
   [28, 1, DeConv, [256, 4, 4, 0]], # 31
   [[24, 30, 31], 1, Concat, [1]], # 32
   [-1, 1, Conv, [256, 3, 1]], # 33

   [27, 1, DeConv, [256, 2, 2, 0]], # 34 8-cls
   [29, 1, DeConv, [256, 4, 4, 0]], # 35
   [[25, 34, 35], 1, Concat, [1]], #
   [-1, 1, Conv, [256, 3, 1]], # 37

   # 16倍下采样
   [24, 1, Conv, [256, 3, 2]], # 38 16-reg
   [28, 1, DeConv, [256, 2, 2, 0]], # 39
   [[26, 38, 39], 1, Concat, [1]], # 40
   [-1, 1, Conv, [256, 3, 1]], # 41

   [25, 1, Conv, [256, 3, 2]], # 42 16-cls
   [29, 1, DeConv, [256, 2, 2, 0]], # 43
   [[27, 42, 43], 1, Concat, [1]], # 44
   [-1, 1, Conv, [256, 3, 1]], # 45

   # 32倍下采样
   [24, 1, Conv, [256, 3, 4]], # 46 32-reg
   [26, 1, Conv, [256, 3, 2]], # 47
   [[28, 46, 47], 1, Concat, [1]], # 48
   [-1, 1, Conv, [256, 3, 1]], # 49

   [25, 1, Conv, [256, 3, 4]], # 50 32-cls
   [26, 1, Conv, [256, 3, 2]], # 51
   [[29, 50, 51], 1, Concat, [1]], # 52
   [-1, 1, Conv, [256, 3, 1]], # 53

   [[33, 37, 41, 45, 49, 53], 1, MixDecoupled_Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
